inletTest10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   2e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.6;

maxDeltaT       0.1;

functions
{
      #includeFunc CourantNo

    yPlus
    {
        type            yPlus;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
    }

    pressure1
    {
        type            pressure;
        libs            (fieldFunctionObjects);
        mode            isentropic;
        calcTotal       yes;
        writeControl    writeTime;
    }

    machNo1
    {
        type            MachNo;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;

    }

    turbulenceField1
    {
        type            turbulenceFields;
        libs            (fieldFunctionObjects);
        fields          (I L);
        writeControl    writeTime;
        
    }

}


// ************************************************************************* //
