inletTest10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottomEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11076;
        startFace       21908;
    }
    topEmptyFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11076;
        startFace       32984;
    }
    inlet
    {
        type            patch;
        nFaces          70;
        startFace       44060;
    }
    outlet
    {
        type            patch;
        nFaces          34;
        startFace       44130;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          768;
        startFace       44164;
    }
    rightWall
    {
        type            patch;
        nFaces          30;
        startFace       44932;
    }
    symmetryLine
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          150;
        startFace       44962;
    }
)

// ************************************************************************* //
